app/controllers/posts_controller.rb

  def index
    if params[:search_field]
      @users_search = User.where('name LIKE ?',"%#{params[:search_field]}")
---
SELECT "users".* FROM "users" WHERE "users"."name" = ?  [["name", "{:placeholder=>\"Buscar por usuário\"}"]]

  def create
    @post = Post.new(post_params)
    @post.user = @current_user
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Primeira postagem risos"], ["user_id", 6], ["created_at", "2017-07-12 23:02:22.848631"], ["updated_at", "2017-07-12 23:02:22.848631"]]

  def like_post
    @post.update(n_likes: @post.n_likes + 1)
---
UPDATE "posts" SET "n_likes" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["n_likes", 2], ["updated_at", "2017-07-15 03:14:28.248117"], ["id", 1]]