app/controllers/user_controller.rb

  def show_user_posts
    @user_posts = @user.posts.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["user_id", 1]]

  def follow_unfollow_user
    if !@current_user.follows?(@user)
      @current_user.followers << @user
    else
      @current_user.followers.delete(@user)
---
INSERT INTO "followers" ("user_id", "follower_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["follower_id", 1], ["created_at", "2017-07-13 22:20:15.564891"], ["updated_at", "2017-07-13 22:20:15.564891"]]
DELETE FROM "followers" WHERE "followers"."user_id" = ? AND "followers"."follower_id" = 1  [["user_id", 2]]